Revit 2027 API
ParameterTypeId.RebarSystemNumberOfLinesTopDir1Generic Property
 "Top/Exterior Major Number Of Lines"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemNumberOfLinesTopDir1Generic { get; }
Public Shared ReadOnly Property RebarSystemNumberOfLinesTopDir1Generic As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemNumberOfLinesTopDir1Generic {
	ForgeTypeId^ get ();
}
static member RebarSystemNumberOfLinesTopDir1Generic : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace